/*
3.Дано розмір файлу в байтах. Використовуючи операцію цілочисельного ділення,
знайти кількість повних кілобайт, які займає даний файл (1 кілобайт = 1 024 байта).
161, Лейзеровіч Олексій
Тестові дані: -321; 1024; 4050
*/
#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "UKRAINIAN");
	int b = 0;
	cout << "Введи розмiр фалйу у байтах."<<endl<<"!!!УВАГА!!!"<<endl<<"Розмiр файлу не можу мати вiд'ємне значення або дорiвнювати 0."<<endl;
	cin >> b;
	while (b<=0)
		{
			cout << "Не можливо використати дану змiнну. Спробуйте знову"<<endl;
			cin >> b;
		}
	int kb = 0;
	kb = b / 1024;
	cout << "Файл займає " << kb << " повних кiлобайт";
	return 0;
}