/*
Дні тижня пронумеровані наступним чином: 1 - понеділок, 2 - вівторок, ..., 6 - субота, 7 - неділя. Дано ціле число K , що лежить в діапазоні 1-365. 
Визначити номер дня тижня для K - го дня року, якщо відомо, що цього року 1 січня було вівторком. */

#include<iostream>

using namespace std;


int main()
{
	setlocale(LC_ALL,"UKR");
	cout << "Введи день року, не більше 365: ";
	int d;
	cin >> d;
	while (d <= 0 || d >= 366)
	{
		cout << "Даний формат числа не пiдходить" << endl;
		cin >> d;
	}
	cout << "Це буде " << (d % 7) + 1 << " день тижня" << endl;
	return 0;
}