/*
Дано тризначне число. Використовуючи одну операцію цілочисельного ділення, 
вивести першу цифру даного числа (сотні) і другу цифру (десятки).
161, Лейзеровіч Олексій
Тестові дані: 25 456 -124
*/
#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    setlocale(LC_ALL, "ukr");
    int a = 0;
    cout << "Введи трьозначне число" << endl;
    cin >> a;
    while (a <= 99 || a >= 1000)
    {
        cout << "Треба ввести трьозначне число." << endl;
        cin >> a;
    }
    int f = 0, l = 0; int c = a / 10;
    f = abs(c / 10);
    l = abs(c % 10);
    cout << "Перша цифра трьозначного числа " << a << ": " << f << endl << "друга цифра трьозначного числа " << a << ": " << l << endl;
    return 0;
}