/*
Описати рекурсивну функцію Fib1 (N) цілого типу, яка обчислює N-й елемент послідовності чисел Фібоначчі (N - ціле число):
F1 = F2 = 1,
FK = FK-2 + FK-1, K = 3, 4, ....
За допомогою цієї функції знайти п'ять чисел Фібоначчі з даними номерами, 
і вивести ці числа разом з кількістю рекурсивних викликів функції Fib1, що необхідні для їх знаходження.
*/

#include <iostream>

using namespace std;

int t=1;

int Fib1(int N)
{
	t++;
	if (N == 1 || N == 2)
	{
		return 1;
	}
	else
	{
		return Fib1(N - 1) + Fib1(N - 2);
	}
}

int main()
{
	int a;
	cin >> a;
	for (int i = 0; i < 4; i++)
	{
		cout << Fib1(a) << endl;
		if (i != 4)
		{
			cin >> a;
		}
	}
	return 0;
}